Revit 2024 API
BuiltInFailures.SweepFailures Class
 Failures about Sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SweepFailures
Visual Basic
Public NotInheritable Class SweepFailures
Visual C++
public ref class SweepFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SweepFailures
See Also
BuiltInFailures.SweepFailures Members
Autodesk.Revit.DB Namespace